Правильно
# def is_even (x):
#     if x%2==0:
#         print ("True")
#     else:
#         print('false')
#
# is_even(6)

Правильно
# def is_year_leap(x):
#     if x%4==0:
#         print("leap year")
#     else:
#         print("not a leap year")
#
# is_year_leap(243)
Не соответствует условиям задачи
# Task3 to 05.10.2023
# Написать функцию square, принимающую 1 аргумент — сторону квадрата, и возвращающую 3 значения в строке
# (к примеру "периметр квадрата = 8, площадь квадрата = 4, диагональ квадрата = 2.2  ...   "):
# периметр квадрата(perimeter of a square),
# площадь квадрата(area of the square) и
# диагональ квадрата(diagonal of a square).
# Подсказака - что бы подставить переменную(variables) в строку нужно начать строку с f символа и
# обернуть variables в  braces - {}
# perimeter = 8
# area = 4
# diagonal = 2.2
# result = f"периметр квадрата = {perimeter}, площадь квадрата = {area}, диагональ квадрата = {diagonal}"
# print(result)

# Комментарий: ф-ция должна вернуть одну строку в которой будут перечислены все значения, а не вывести значения внутри функции(не нужно делать print внутри ф-ции) 
# def square(x):
#
#     y=10
#     z=5
#     y=10
#     print("first side is", x)
#     print("first side is", y)
#     print("first side is", z)
#     print("first side is", y)
#     perimeter=x+y+z+y
#     print("perimeter:",perimeter)
#     area=x*y
#     print("area:", area)
#     diagonal=(2*x*x)
#     print("diagonal", diagonal)
# square(7)

Еще решить # Task4 to 06.10.2023
# Напишите функцию sum_range(start, end), которая суммирует все целые числа от значения «start» до величины «end» включительно. 
# Если пользователь задаст первое число большее чем второе, просто поменяйте их местами.
Подсказка - используй встроенне функции range() и sum().(Загугли в google что и как они делают) 

